In [1]:
import pandas as pd
import numpy as np

In [5]:
#Creating a series
df=pd.Series(["Gouri",12,"Benni",78])
df

0    Gouri
1       12
2    Benni
3       78
dtype: object

In [7]:
#Creating a DataFrame
list1=[1,2,3,4,5,6,6,]

In [9]:
df=pd.DataFrame(list1)
print(df)

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  6

In [13]:
#Creating a DataFrame
df=pd.DataFrame(["Gouri","is","a","good girl"])

In [14]:
df

           0
0      Gouri
1         is
2          a
3  good girl

In [248]:
#Creating a DataFrame from Dictionary
data = {
    'name':["Gouri","Nitin","Samarth"],
    'age' :[24,29,18],
    'Country':["USA","USA","India"]
}
#Labeling indexes
index_labels=["r0","r1","r2"]
df=pd.DataFrame(data,index_labels) #passing index values
df

       name  age Country
r0    Gouri   24     USA
r1    Nitin   29     USA
r2  Samarth   18   India

In [73]:
#Accessing Single Column
df['name']

r0      Gouri
r1      Nitin
r2    Samarth
Name: name, dtype: object

In [72]:
#Accessing multiple Columns
df[['name',"age"]]

       name  age
r0    Gouri   24
r1    Nitin   29
r2  Samarth   18

In [101]:
#accessing a single row using iloc
df.iloc[0]

name       Gouri
age           24
Country      USA
Name: r0, dtype: object

In [102]:
#Multiple rows using iloc
df.iloc[[0,1]]

     name  age Country
r0  Gouri   24     USA
r1  Nitin   29     USA

In [105]:
#to check for missing values
df.isnull()

     name    age  Country
r0  False  False    False
r1  False  False    False
r2  False  False    False

In [106]:
#To get the sum 
df.isnull().sum()

name       0
age        0
Country    0
dtype: int64

In [107]:
#rows with non-null values
df.notnull()

    name   age  Country
r0  True  True     True
r1  True  True     True
r2  True  True     True

In [125]:
#Created new Dictinary using null values
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}

In [126]:
df1=pd.DataFrame(dict)

In [127]:
df1

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [119]:
df1.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [120]:
df1.notnull()

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

In [130]:
df1

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [131]:
#fills the null values with value 4
df1.fillna(4)

   First Score  Second Score  Third Score
0        100.0          30.0          4.0
1         90.0          45.0         40.0
2          4.0          56.0         80.0
3         95.0           4.0         98.0

In [132]:
dict2 = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
df2=pd.DataFrame(dict2)
df2

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [134]:
#drop rows with atleast one null value
df2.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [135]:
df2

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [136]:
#drops the column with atleast one null value
df2.dropna(1)

C:\Users\Checkout\AppData\Local\Temp\ipykernel_3176\970851846.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.dropna will be keyword-only.
  df2.dropna(1)

   Third Score
0           52
1           40
2           80
3           98

In [140]:
#drops rows with atleast one missing value
df2.dropna(0)

C:\Users\Checkout\AppData\Local\Temp\ipykernel_3176\1921704711.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.dropna will be keyword-only.
  df2.dropna(0)

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [143]:
#Drops rows with atleast one null vaule
df2.dropna(axis=0)

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [144]:
#drops columns with atleast one null value
df2.dropna(axis=1)

   Third Score
0           52
1           40
2           80
3           98

In [145]:
df2

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [159]:
# iterating over rows using iterrows() function 
for i,j in df.iterrows():
    print(i,j)

r0 name       Gouri
age           24
Country      USA
Name: r0, dtype: object
r1 name       Nitin
age           29
Country      USA
Name: r1, dtype: object
r2 name       Samarth
age             18
Country      India
Name: r2, dtype: object

In [160]:
#using iteritems() over rows
for i,j in df.iteritems():
    print(i,j)

name r0      Gouri
r1      Nitin
r2    Samarth
Name: name, dtype: object
age r0    24
r1    29
r2    18
Name: age, dtype: int64
Country r0      USA
r1      USA
r2    India
Name: Country, dtype: object

In [167]:
df

       name  age Country
r0    Gouri   24     USA
r1    Nitin   29     USA
r2  Samarth   18   India

In [2]:
for i in data:
    print(df[i][1])

NameError: name 'data' is not defined

##

In [183]:
df2

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [185]:
#It returns the count of unique values in the DataFrame
df2.nunique()

First Score     3
Second Score    3
Third Score     4
Fourth Score    1
dtype: int64

In [186]:
#
df2.value_counts()

First Score  Second Score  Third Score  Fourth Score
95.0         56.0          98           65.0            1
dtype: int64

In [201]:
df2[0:2]

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN

In [202]:
df2.head(2)

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN

In [206]:
#Creating two series and adding two series
data1=pd.Series([3,4,5,6,7])
data1

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [208]:
data2=pd.Series([2,3,4,5,8])
data2

0    2
1    3
2    4
3    5
4    8
dtype: int64

In [211]:
#Adding two series
#Can also perform sub, multiply and divide funstions
data1.add(data2)

0     5
1     7
2     9
3    11
4    15
dtype: int64

In [215]:
df2

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [221]:
#Sum of rows
df2.sum(1)

0    182.0
1    130.0
2    125.0
3    314.0
dtype: float64

In [222]:
#Sum of Columns
df2.sum(0)

First Score     285.0
Second Score    131.0
Third Score     270.0
Fourth Score     65.0
dtype: float64

In [224]:
#Product of axis
df2.prod(1)

0      156000.0
1        3600.0
2        3600.0
3    33888400.0
dtype: float64

In [232]:
#Returns mean
df2.mean()

First Score     95.000000
Second Score    43.666667
Third Score     67.500000
Fourth Score    65.000000
dtype: float64

In [229]:
#Returns the power of 3
df2.pow(3)

   First Score  Second Score  Third Score  Fourth Score
0    1000000.0       27000.0       140608           NaN
1     729000.0           NaN        64000           NaN
2          NaN       91125.0       512000           NaN
3     857375.0      175616.0       941192      274625.0

In [233]:
df2.abs()

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [253]:
ser1 = pd.Series(np.linspace(3, 33, 3))
print(ser1)

0     3.0
1    18.0
2    33.0
dtype: float64

In [254]:
#Generates random numbers
ser10=pd.Series(range(20))
ser10

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int64

In [255]:
df2.describe()

       First Score  Second Score  Third Score  Fourth Score
count          3.0      3.000000     4.000000           1.0
mean          95.0     43.666667    67.500000          65.0
std            5.0     13.051181    26.350206           NaN
min           90.0     30.000000    40.000000          65.0
25%           92.5     37.500000    49.000000          65.0
50%           95.0     45.000000    66.000000          65.0
75%           97.5     50.500000    84.500000          65.0
max          100.0     56.000000    98.000000          65.0

In [282]:
#Adding a Column
dict1 = {
    'name':["Hey","Sup","Okay"],
    'Age':[67,87,90],
    'Choice':["Apple","Mango","Fine"]
}
df20=pd.DataFrame(dict1)
print(df20)
#Adding
addcolumn = ["Hello","HRU","Yes"]
df20['addcolumn1']=addcolumn
df20

   name  Age Choice
0   Hey   67  Apple
1   Sup   87  Mango
2  Okay   90   Fine

   name  Age Choice addcolumn1
0   Hey   67  Apple      Hello
1   Sup   87  Mango        HRU
2  Okay   90   Fine        Yes

In [285]:
#Dropping Columns
df20.drop(['Age'],axis=1,inplace=True)

In [286]:
df20

   name addcolumn1
0   Hey      Hello
1   Sup        HRU
2  Okay        Yes

In [293]:
#Adding a row
dict1 = {
    'name':["Hey","Sup","Okay"],
    'Age':[67,87,90],
    'Choice':["Apple","Mango","Fine"]
}
df20=pd.DataFrame(dict1)
print(df20)
new_row=pd.DataFrame(
    {'name':"Whatevr",'Age':12,'Choice':"Dont"},index=[3])
df200=pd.concat([new_row,df20]).reset_index(drop=True)

   name  Age Choice
0   Hey   67  Apple
1   Sup   87  Mango
2  Okay   90   Fine

In [294]:
df2

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [298]:
#Using Groupby Function for one Column
df2.groupby('First Score')
print(df2.groupby(['First Score']).groups)

{90.0: [1], 95.0: [3], 100.0: [0]}

In [304]:
#Using Groupby Function for multiple columns
df2.groupby(['First Score','Third Score'])
print(df2.groupby(['First Score','Third Score']).groups)

{(90.0, 40): [1], (100.0, 52): [0], (nan, 80): [2], (95.0, 98): [3]}